jncronin/gk/gk-pcbv4/cubemx/cubemx.ioc
DDR_CTRL_PHY.UIS_SWIZZLE_19_REG=\#define DDR_UIS_SWIZZLE_19 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_1_REG=\#define DDR_UIS_SWIZZLE_1 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_20_REG=\#define DDR_UIS_SWIZZLE_20 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_21_REG=\#define DDR_UIS_SWIZZLE_21 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_22_REG=\#define DDR_UIS_SWIZZLE_22 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_23_REG=\#define DDR_UIS_SWIZZLE_23 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_24_REG=\#define DDR_UIS_SWIZZLE_24 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_25_REG=\#define DDR_UIS_SWIZZLE_25 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_26_REG=\#define DDR_UIS_SWIZZLE_26 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_27_REG=\#define DDR_UIS_SWIZZLE_27 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_28_REG=\#define DDR_UIS_SWIZZLE_28 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_29_REG=\#define DDR_UIS_SWIZZLE_29 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_2_REG=\#define DDR_UIS_SWIZZLE_2 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_30_REG=\#define DDR_UIS_SWIZZLE_30 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_31_REG=\#define DDR_UIS_SWIZZLE_31 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_32_REG=\#define DDR_UIS_SWIZZLE_32 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_33_REG=\#define DDR_UIS_SWIZZLE_33 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_34_REG=\#define DDR_UIS_SWIZZLE_34 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_35_REG=\#define DDR_UIS_SWIZZLE_35 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_36_REG=\#define DDR_UIS_SWIZZLE_36 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_37_REG=\#define DDR_UIS_SWIZZLE_37 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_38_REG=\#define DDR_UIS_SWIZZLE_38 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_39_REG=\#define DDR_UIS_SWIZZLE_39 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_3_REG=\#define DDR_UIS_SWIZZLE_3 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_40_REG=\#define DDR_UIS_SWIZZLE_40 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_41_REG=\#define DDR_UIS_SWIZZLE_41 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_42_REG=\#define DDR_UIS_SWIZZLE_42 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_43_REG=\#define DDR_UIS_SWIZZLE_43 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_4_REG=\#define DDR_UIS_SWIZZLE_4 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_5_REG=\#define DDR_UIS_SWIZZLE_5 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_6_REG=\#define DDR_UIS_SWIZZLE_6 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_7_REG=\#define DDR_UIS_SWIZZLE_7 0x00000004
DDR_CTRL_PHY.UIS_SWIZZLE_8_REG=\#define DDR_UIS_SWIZZLE_8 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_9_REG=\#define DDR_UIS_SWIZZLE_9 0x00000004
DDR_CTRL_PHY.WDQSEXT=1
DDR_CTRL_PHY.WL=12
DDR_CTRL_PHY.ZQCTL0_REG=\#define DDR_ZQCTL0 0x06400030
DDR_CTRL_PHY.ZQCTL1_REG=\#define DDR_ZQCTL1 0x0500c350
DDR_CTRL_PHY.ZQCTL2_REG=\#define DDR_ZQCTL2 0x00000000
DDR_CTRL_PHY.memclk=3200.0
DDR_CTRL_PHY.nRTP=10
DDR_CTRL_PHY.nWR=24
DDR_CTRL_PHY.tRFCab=380
DDR_CTRL_PHY.tRFCpb=190
DDR_CTRL_PHY.tXSR=387.5
File.Version=6
GIC.LTDC_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RCC_WAKEUP_IRQn=true\:false\:High level
GPIO.groupedBy=Group By Peripherals
I2C1.IPParameters=Timing
I2C1.Timing=0x10707DBC
I2C2.IPParameters=Timing
I2C2.Timing=0x10707DBC
I2C4.IPParameters=Timing
I2C4.Timing=0x10707DBC
I2C7.IPParameters=Timing
I2C7.Timing=0x10707DBC
JTCK-SWCLK.GPIOParameters=PinAttribute
JTCK-SWCLK.Mode=Trace_Synchro_2bits_SW
JTCK-SWCLK.PinAttribute=CortexM33NS
JTCK-SWCLK.Signal=DEBUG_JTCK-SWCLK
JTDO-TRACESWO.GPIOParameters=PinAttribute
JTDO-TRACESWO.Locked=true
JTDO-TRACESWO.PinAttribute=CortexM33NS
JTDO-TRACESWO.Signal=DEBUG_JTDO-SWO
JTMS-SWDIO.GPIOParameters=PinAttribute
JTMS-SWDIO.Mode=Trace_Synchro_2bits_SW
JTMS-SWDIO.PinAttribute=CortexM33NS
JTMS-SWDIO.Signal=DEBUG_JTMS-SWDIO
KeepUserPlacement=true
Mcu.CPN=STM32MP255DAI3
Mcu.Context0=BootROMA35
Mcu.Context1=CortexA35SFSBLA
Mcu.Context2=CortexA35SSecureOS
Mcu.Context3=CortexA35NSSSBL
Mcu.Context4=CortexA35NSOS
Mcu.Context5=CortexM33NS
Mcu.ContextNb=6
Mcu.ContextProject=A35TD_TZDIS
Mcu.Family=STM32MP2
Mcu.IP0=ADC1
Mcu.IP1=ADC3
Mcu.IP10=I2C7
Mcu.IP11=LTDC
Mcu.IP12=NVIC2
Mcu.IP13=OCTOSPI1
Mcu.IP14=OCTOSPIM
Mcu.IP15=PWR
Mcu.IP16=RCC
Mcu.IP17=RIF
Mcu.IP18=RTC
Mcu.IP19=SAI2
Mcu.IP2=BSEC
Mcu.IP20=SAI3
Mcu.IP21=SDMMC1
Mcu.IP22=SDMMC2
Mcu.IP23=SPI3
Mcu.IP24=STGEN
Mcu.IP25=SYS
Mcu.IP26=TIM1
Mcu.IP27=TIM2
Mcu.IP28=USART1
Mcu.IP29=USART2
Mcu.IP3=CORTEX_M33
Mcu.IP30=USB3DR
Mcu.IP31=USBH_HS
Mcu.IP4=DDR_CTRL_PHY
Mcu.IP5=DEBUG
Mcu.IP6=GIC
Mcu.IP7=I2C1
Mcu.IP8=I2C2
Mcu.IP9=I2C4
Mcu.IPNb=32
Mcu.Name=STM32MP255DAIx
Mcu.Package=TFBGA436
Mcu.Pin0=PB10
Mcu.Pin1=PB9
Mcu.Pin10=PE4
Mcu.Pin100=PC3
Mcu.Pin101=PA2
Mcu.Pin102=USB3DR_DP
Mcu.Pin103=JTMS-SWDIO
Mcu.Pin104=PA0
Mcu.Pin105=PG2
Mcu.Pin106=PC12
Mcu.Pin107=PC7
Mcu.Pin108=PF5
Mcu.Pin109=PC2
Mcu.Pin11=PE13
Mcu.Pin110=PA13
Mcu.Pin111=PA5
Mcu.Pin112=PA7
Mcu.Pin113=PA4
Mcu.Pin114=USB3DR_DM
Mcu.Pin115=JTCK-SWCLK
Mcu.Pin116=PG4
Mcu.Pin117=PC6
Mcu.Pin118=PC0
Mcu.Pin119=USBH_HS_DP
Mcu.Pin12=PD8
Mcu.Pin120=PB15
Mcu.Pin121=PC11
Mcu.Pin122=PF6
Mcu.Pin123=USBH_HS_DM
Mcu.Pin124=VP_ADC3_Vref_Input
Mcu.Pin125=VP_ADC3_VddCore_Input
Mcu.Pin126=VP_ADC3_VddCpu_Input
Mcu.Pin127=VP_ADC3_VddGpu_Input
Mcu.Pin128=VP_ADC3_Vbat_Input
Mcu.Pin129=VP_BSEC_VS_BSEC
Mcu.Pin13=PD4
Mcu.Pin130=VP_CORTEX_M33_VS_CORTEX_M33
Mcu.Pin131=VP_DDR_CTRL_PHY_LPDDR4
Mcu.Pin132=VP_DDR_CTRL_PHY_VS_16BITS
Mcu.Pin133=VP_DDR_CTRL_PHY_VS_16Gb
Mcu.Pin134=VP_OCTOSPI1_VS_quad
Mcu.Pin135=VP_OCTOSPIM_VS_IO
Mcu.Pin136=VP_RIF_VS_RIF1
Mcu.Pin137=VP_RTC_VS_RTC_Activate
Mcu.Pin138=VP_RTC_VS_RTC_Calendar
Mcu.Pin139=VP_STGEN_VS_STGEN
Mcu.Pin14=PD3
Mcu.Pin140=VP_SYS_VS_Systick
Mcu.Pin15=PE2
Mcu.Pin16=PE5
Mcu.Pin17=PE8
Mcu.Pin18=PE12
Mcu.Pin19=PB4
Mcu.Pin2=PD6
Mcu.Pin20=PB1
Mcu.Pin21=PB7
Mcu.Pin22=PD10
Mcu.Pin23=PD0
Mcu.Pin24=PD7
Mcu.Pin25=PE3
Mcu.Pin26=PE7
Mcu.Pin27=PD11
Mcu.Pin28=PD2
Mcu.Pin29=PD1
Mcu.Pin3=PE0
Mcu.Pin30=PE6
Mcu.Pin31=PE11
Mcu.Pin32=PK3
Mcu.Pin33=PD15
Mcu.Pin34=PE15
Mcu.Pin35=PI12
Mcu.Pin36=PI13
Mcu.Pin37=PG9
Mcu.Pin38=PG14
Mcu.Pin39=PI0
Mcu.Pin4=PE10
Mcu.Pin40=PB8
Mcu.Pin41=PK6
Mcu.Pin42=PD14
Mcu.Pin43=PF14
Mcu.Pin44=PG6
Mcu.Pin45=PG10
Mcu.Pin46=PG15
Mcu.Pin47=PI5
Mcu.Pin48=PI1
Mcu.Pin49=PG12
Mcu.Pin5=PE14
Mcu.Pin50=PG11
Mcu.Pin51=PI2
Mcu.Pin52=PI3
Mcu.Pin53=PI6
Mcu.Pin54=PJ15
Mcu.Pin55=PF12
Mcu.Pin56=PG7
Mcu.Pin57=PG13
Mcu.Pin58=PI4
Mcu.Pin59=PI9
Mcu.Pin6=PB5
Mcu.Pin60=PG5
Mcu.Pin61=PJ12
Mcu.Pin62=PJ14
Mcu.Pin63=PF13
Mcu.Pin64=PG8
Mcu.Pin65=PI7
Mcu.Pin66=PF15
Mcu.Pin67=PJ10
Mcu.Pin68=PJ13
Mcu.Pin69=PJ11
Mcu.Pin7=PD9
Mcu.Pin70=PZ9
Mcu.Pin71=PC13
Mcu.Pin72=OSC32_IN
Mcu.Pin73=OSC32_OUT
Mcu.Pin74=PC10
Mcu.Pin75=PF7
Mcu.Pin76=PA15
Mcu.Pin77=PH11
Mcu.Pin78=PA9
Mcu.Pin79=PA3
Mcu.Pin8=PD5
Mcu.Pin80=PJ6
Mcu.Pin81=PC9
Mcu.Pin82=PH10
Mcu.Pin83=PH8
Mcu.Pin84=PJ0
Mcu.Pin85=OSC_OUT
Mcu.Pin86=OSC_IN
Mcu.Pin87=ANA0
Mcu.Pin88=ANA1
Mcu.Pin89=PC8
Mcu.Pin9=PE1
Mcu.Pin90=PC4
Mcu.Pin91=PC1
Mcu.Pin92=PH2
Mcu.Pin93=PA6
Mcu.Pin94=PA1
Mcu.Pin95=USBH_HS_TXRTUNE
Mcu.Pin96=USB3DR_TXRTUNE
Mcu.Pin97=JTDO-TRACESWO
Mcu.Pin98=PG3
Mcu.Pin99=PG1
Mcu.PinsNb=141
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP255DAIx
MxCube.Version=6.15.0
MxDb.Version=DB.6.0.150
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
OSC32_IN.GPIOParameters=PinAttribute
OSC32_IN.Mode=LSE-External-Oscillator
OSC32_IN.PinAttribute=
OSC32_IN.Signal=RCC_OSC32_IN
OSC32_OUT.GPIOParameters=PinAttribute
OSC32_OUT.Mode=LSE-External-Oscillator
OSC32_OUT.PinAttribute=
OSC32_OUT.Signal=RCC_OSC32_OUT
OSC_IN.GPIOParameters=PinAttribute
OSC_IN.Mode=HSE-External-Oscillator
OSC_IN.PinAttribute=
OSC_IN.Signal=RCC_OSC_IN
OSC_OUT.GPIOParameters=PinAttribute
OSC_OUT.Mode=HSE-External-Oscillator
OSC_OUT.PinAttribute=
OSC_OUT.Signal=RCC_OSC_OUT
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=WakeUp1
PA0.PinAttribute=
PA0.Signal=PWR_WKUP1
PA1.GPIOParameters=PinAttribute
PA1.Mode=RGB888
PA1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PA1.Signal=LTDC_R3
PA13.GPIOParameters=PinAttribute
PA13.Locked=true
PA13.PinAttribute=Free
PA13.Signal=GPIO_Output
PA15.GPIOParameters=PinAttribute
PA15.Mode=Asynchronous
PA15.PinAttribute=CortexM33NS
PA15.Signal=USART2_RX
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.PinAttribute=Free
PA2.Signal=GPIO_Output
PA3.GPIOParameters=PinAttribute
PA3.Mode=I2C
PA3.PinAttribute=CortexM33NS
PA3.Signal=I2C1_SCL
PA4.GPIOParameters=PinAttribute
PA4.PinAttribute=CortexM33NS
PA4.Signal=S_TIM2_CH1
PA5.GPIOParameters=PinAttribute
PA5.Locked=true
PA5.PinAttribute=Free
PA5.Signal=GPIO_Input
PA6.GPIOParameters=PinAttribute
PA6.Locked=true
PA6.PinAttribute=Free
PA6.Signal=GPIO_Output
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.PinAttribute=Free
PA7.Signal=GPIO_Output
PA9.GPIOParameters=PinAttribute
PA9.Mode=CTS_RTS
PA9.PinAttribute=CortexM33NS
PA9.Signal=USART2_CTS
PB1.GPIOParameters=PinAttribute
PB1.Mode=NSS_Signal_Hard_Output
PB1.PinAttribute=CortexM33NS
PB1.Signal=SPI3_NSS
PB10.GPIOParameters=PinAttribute
PB10.Mode=Full_Duplex_Master
PB10.PinAttribute=CortexM33NS
PB10.Signal=SPI3_MISO
PB15.GPIOParameters=PinAttribute
PB15.Mode=RGB888
PB15.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PB15.Signal=LTDC_R4
PB4.GPIOParameters=PinAttribute
PB4.Mode=I2C
PB4.PinAttribute=CortexM33NS
PB4.Signal=I2C2_SDA
PB5.GPIOParameters=PinAttribute
PB5.Mode=I2C
PB5.PinAttribute=CortexM33NS
PB5.Signal=I2C2_SCL
PB7.GPIOParameters=PinAttribute
PB7.Mode=Full_Duplex_Master
PB7.PinAttribute=CortexM33NS
PB7.Signal=SPI3_SCK
PB8.GPIOParameters=PinAttribute
PB8.Mode=Full_Duplex_Master
PB8.PinAttribute=CortexM33NS
PB8.Signal=SPI3_MOSI
PB9.GPIOParameters=PinAttribute
PB9.Mode=CTS_RTS
PB9.PinAttribute=CortexM33NS
PB9.Signal=USART1_RTS
PC0.GPIOParameters=PinAttribute
PC0.Locked=true
PC0.PinAttribute=Free
PC0.Signal=GPIO_Output
PC1.GPIOParameters=PinAttribute
PC1.Mode=Asynchronous
PC1.PinAttribute=CortexM33NS
PC1.Signal=USART2_TX
PC10.GPIOParameters=PinAttribute
PC10.Mode=Enable
PC10.PinAttribute=CortexA35NSOS
PC10.Signal=USBH_HS_VBUSEN
PC11.GPIOParameters=PinAttribute
PC11.Mode=RGB888
PC11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC11.Signal=LTDC_R2
PC12.GPIOParameters=PinAttribute
PC12.Locked=true
PC12.PinAttribute=Free
PC12.Signal=GPIO_Input
PC13.GPIOParameters=PinAttribute
PC13.Mode=WakeUpAF1
PC13.PinAttribute=
PC13.Signal=RTC_OUT1
PC2.GPIOParameters=PinAttribute
PC2.Mode=CTS_RTS
PC2.PinAttribute=CortexM33NS
PC2.Signal=USART2_RTS
PC3.GPIOParameters=PinAttribute
PC3.Locked=true
PC3.PinAttribute=Free
PC3.Signal=GPIO_Output
PC4.GPIOParameters=PinAttribute
PC4.Locked=true
PC4.PinAttribute=Free
PC4.Signal=GPIO_Output
PC6.GPIOParameters=PinAttribute
PC6.Mode=RGB888
PC6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PC6.Signal=LTDC_CLK
PC7.GPIOParameters=PinAttribute
PC7.Locked=true
PC7.PinAttribute=Free
PC7.Signal=GPIO_Output
PC8.GPIOParameters=PinAttribute
PC8.Locked=true
PC8.PinAttribute=Free
PC8.Signal=GPIO_Output
PC9.GPIOParameters=PinAttribute
PC9.Mode=IN8-Single-Ended
PC9.PinAttribute=CortexM33NS
PC9.Signal=ADC1_INP8
PD0.GPIOParameters=PinAttribute
PD0.Mode=OCTOSPI1_Port1Quad
PD0.PinAttribute=BootROMA35
PD0.Signal=OCTOSPIM_P1_CLK
PD1.GPIOParameters=PinAttribute
PD1.Locked=true
PD1.PinAttribute=Free
PD1.Signal=EVENTOUT
PD10.GPIOParameters=PinAttribute
PD10.Locked=true
PD10.Mode=I2C
PD10.PinAttribute=CortexM33NS
PD10.Signal=I2C4_SDA
PD11.GPIOParameters=PinAttribute
PD11.Locked=true
PD11.Mode=I2C
PD11.PinAttribute=CortexM33NS
PD11.Signal=I2C4_SCL
PD14.GPIOParameters=PinAttribute
PD14.Mode=I2C
PD14.PinAttribute=CortexM33NS
PD14.Signal=I2C7_SDA
PD15.GPIOParameters=PinAttribute
PD15.Mode=I2C
PD15.PinAttribute=CortexM33NS
PD15.Signal=I2C7_SCL
PD2.GPIOParameters=PinAttribute
PD2.Locked=true
PD2.PinAttribute=Free
PD2.Signal=EVENTOUT
PD3.GPIOParameters=PinAttribute
PD3.Mode=OCTOSPI1_Port1_NCS1
PD3.PinAttribute=BootROMA35
PD3.Signal=OCTOSPIM_P1_NCS1
PD4.GPIOParameters=PinAttribute
PD4.Mode=OCTOSPI1_Port1Quad
PD4.PinAttribute=BootROMA35
PD4.Signal=OCTOSPIM_P1_IO0
PD5.GPIOParameters=PinAttribute
PD5.Mode=OCTOSPI1_Port1Quad
PD5.PinAttribute=BootROMA35
PD5.Signal=OCTOSPIM_P1_IO1
PD6.GPIOParameters=PinAttribute
PD6.Mode=OCTOSPI1_Port1Quad
PD6.PinAttribute=BootROMA35
PD6.Signal=OCTOSPIM_P1_IO2
PD7.GPIOParameters=PinAttribute
PD7.Mode=OCTOSPI1_Port1Quad
PD7.PinAttribute=BootROMA35
PD7.Signal=OCTOSPIM_P1_IO3
PD8.GPIOParameters=PinAttribute
PD8.Locked=true
PD8.PinAttribute=Free
PD8.Signal=EVENTOUT
PD9.GPIOParameters=PinAttribute
PD9.Locked=true
PD9.PinAttribute=Free
PD9.Signal=EVENTOUT
PE0.GPIOParameters=PinAttribute
PE0.Mode=SD_4_bits_Wide_bus
PE0.PinAttribute=CortexM33NS
PE0.Signal=SDMMC1_D2
PE1.GPIOParameters=PinAttribute
PE1.Mode=SD_4_bits_Wide_bus
PE1.PinAttribute=CortexM33NS
PE1.Signal=SDMMC1_D3
PE10.GPIOParameters=PinAttribute
PE10.Mode=CTS_RTS
PE10.PinAttribute=CortexM33NS
PE10.Signal=USART1_CTS
PE11.GPIOParameters=PinAttribute
PE11.Mode=SD_4_bits_Wide_bus
PE11.PinAttribute=CortexM33NS
PE11.Signal=SDMMC2_D1
PE12.GPIOParameters=PinAttribute
PE12.Mode=SD_4_bits_Wide_bus
PE12.PinAttribute=CortexM33NS
PE12.Signal=SDMMC2_D3
PE13.GPIOParameters=PinAttribute
PE13.Mode=SD_4_bits_Wide_bus
PE13.PinAttribute=CortexM33NS
PE13.Signal=SDMMC2_D0
PE14.GPIOParameters=PinAttribute
PE14.Mode=SD_4_bits_Wide_bus
PE14.PinAttribute=CortexM33NS
PE14.Signal=SDMMC2_CK
PE15.GPIOParameters=PinAttribute
PE15.Mode=SD_4_bits_Wide_bus
PE15.PinAttribute=CortexM33NS
PE15.Signal=SDMMC2_CMD
PE2.GPIOParameters=PinAttribute
PE2.Mode=SD_4_bits_Wide_bus
PE2.PinAttribute=CortexM33NS
PE2.Signal=SDMMC1_CMD
PE3.GPIOParameters=PinAttribute
PE3.Mode=SD_4_bits_Wide_bus
PE3.PinAttribute=CortexM33NS
PE3.Signal=SDMMC1_CK
PE4.GPIOParameters=PinAttribute
PE4.Mode=SD_4_bits_Wide_bus
PE4.PinAttribute=CortexM33NS
PE4.Signal=SDMMC1_D0
PE5.GPIOParameters=PinAttribute
PE5.Mode=SD_4_bits_Wide_bus
PE5.PinAttribute=CortexM33NS
PE5.Signal=SDMMC1_D1
PE6.GPIOParameters=PinAttribute
PE6.Mode=Asynchronous
PE6.PinAttribute=CortexM33NS
PE6.Signal=USART1_TX
PE7.GPIOParameters=PinAttribute
PE7.Mode=Asynchronous
PE7.PinAttribute=CortexM33NS
PE7.Signal=USART1_RX
PE8.GPIOParameters=PinAttribute
PE8.Mode=SD_4_bits_Wide_bus
PE8.PinAttribute=CortexM33NS
PE8.Signal=SDMMC2_D2
PF12.GPIOParameters=PinAttribute
PF12.Mode=Trace_Synchro_2bits_SW
PF12.PinAttribute=CortexM33NS
PF12.Signal=DEBUG_TRACECLK
PF13.GPIOParameters=PinAttribute
PF13.Mode=Trace_Synchro_2bits_SW
PF13.PinAttribute=CortexM33NS
PF13.Signal=DEBUG_TRACED0
PF14.GPIOParameters=PinAttribute
PF14.Mode=Trace_Synchro_2bits_SW
PF14.PinAttribute=CortexM33NS
PF14.Signal=DEBUG_TRACED1
PF15.GPIOParameters=PinAttribute
PF15.Locked=true
PF15.PinAttribute=CortexM33NS
PF15.Signal=DEBUG_TRACED2
PF5.GPIOParameters=PinAttribute
PF5.Mode=SAI_A_MasterWithClock
PF5.PinAttribute=CortexM33NS
PF5.Signal=SAI3_MCLK_A
PF6.GPIOParameters=PinAttribute
PF6.Locked=true
PF6.PinAttribute=Free
PF6.Signal=GPIO_Output
PF7.GPIOParameters=PinAttribute
PF7.Mode=SAI_A_MasterWithClock
PF7.PinAttribute=CortexM33NS
PF7.Signal=SAI3_SD_A
PG1.GPIOParameters=PinAttribute
PG1.Mode=RGB888
PG1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG1.Signal=LTDC_VSYNC
PG10.GPIOParameters=PinAttribute
PG10.Mode=RGB888
PG10.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG10.Signal=LTDC_G4
PG11.GPIOParameters=PinAttribute
PG11.Mode=RGB888
PG11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG11.Signal=LTDC_G5
PG12.GPIOParameters=PinAttribute
PG12.Mode=RGB888
PG12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG12.Signal=LTDC_G6
PG13.GPIOParameters=PinAttribute
PG13.Mode=RGB888
PG13.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG13.Signal=LTDC_G7
PG14.GPIOParameters=PinAttribute
PG14.Mode=RGB888
PG14.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG14.Signal=LTDC_B1
PG15.GPIOParameters=PinAttribute
PG15.Mode=RGB888
PG15.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG15.Signal=LTDC_B2
PG2.GPIOParameters=PinAttribute
PG2.Mode=SAI_A_MasterWithClock
PG2.PinAttribute=CortexM33NS
PG2.Signal=SAI2_FS_A
PG3.GPIOParameters=PinAttribute
PG3.Mode=RGB888
PG3.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG3.Signal=LTDC_R5
PG4.GPIOParameters=PinAttribute
PG4.Mode=IN4-Single-Ended
PG4.PinAttribute=CortexM33NS
PG4.Signal=ADC1_INP4
PG5.GPIOParameters=PinAttribute
PG5.Locked=true
PG5.PinAttribute=CortexM33NS
PG5.Signal=DEBUG_TRACED3
PG6.GPIOParameters=PinAttribute
PG6.Mode=RGB888
PG6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG6.Signal=LTDC_R6
PG7.GPIOParameters=PinAttribute
PG7.Mode=RGB888
PG7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG7.Signal=LTDC_R7
PG8.GPIOParameters=PinAttribute
PG8.Mode=RGB888
PG8.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG8.Signal=LTDC_G2
PG9.GPIOParameters=PinAttribute
PG9.Mode=RGB888
PG9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG9.Signal=LTDC_G3
PH10.GPIOParameters=PinAttribute
PH10.Mode=SAI_A_MasterWithClock
PH10.PinAttribute=CortexM33NS
PH10.Signal=SAI3_SCK_A
PH11.GPIOParameters=PinAttribute
PH11.Mode=SAI_A_MasterWithClock
PH11.PinAttribute=CortexM33NS
PH11.Signal=SAI3_FS_A
PH2.GPIOParameters=PinAttribute
PH2.Locked=true
PH2.PinAttribute=Free
PH2.Signal=GPIO_Output
PH8.GPIOParameters=PinAttribute
PH8.Locked=true
PH8.PinAttribute=Free
PH8.Signal=GPIO_Input
PI0.GPIOParameters=PinAttribute
PI0.Mode=RGB888
PI0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI0.Signal=LTDC_B3
PI1.GPIOParameters=PinAttribute
PI1.Mode=RGB888
PI1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI1.Signal=LTDC_B4
PI12.GPIOParameters=PinAttribute
PI12.Mode=RGB888
PI12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI12.Signal=LTDC_G0
PI13.GPIOParameters=PinAttribute
PI13.Mode=RGB888
