jncronin/gk/gk-pcbv4/cubemx/cubemx.ioc
RIF.RIFAWARE.EXTI1\ Feature\ UART8\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ USART2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ USART3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART6\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ USART6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USB3DR\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ USBH\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ VDDGPU_VD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP1\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP2\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP3\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP4\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP4\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP5\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP5\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WKUP6\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ WKUP6\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ WWDG1\ Reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ ADF1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ ADF1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CA35\ SEV\ interrupt\ to\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ CA35\ SEV\ interrupt\ to\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CDBGPWRUPREQ\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CM0\ SEV\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ CM33\ SEV\ interrupt\ to\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ CM33\ SEV\ interrupt\ to\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[0]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[0]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[10]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[10]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[11]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[11]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[12]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[12]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[13]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[13]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[14]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[14]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[15]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[15]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[1]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[1]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[2]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[2]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[3]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[3]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[4]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[4]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[5]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[5]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[6]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[6]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[7]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[7]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[8]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[8]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[9]\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ EXTI2[9]\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM1\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM2\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ HSEM3\ non\ secure\ interrupt\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ HSEM3\ non\ secure\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ I2C8\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ I2C8\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ I3C4\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ I3C4\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU1\ Secure=true
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IAC\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ non\ secure\ interrupt\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IPCC2\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ reset\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG1\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG2\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG3\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG4\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG5\ early\ wake\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ IWDG5\ early\ wake\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ IWDG5\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM4\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM4\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM5\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPTIM5\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ LPUART1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ LPUART1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RETRAM\ CRC\ error\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ RETRAM\ CRC\ error\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ non\ secure\ Wakeup\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU1\ Secure=true
RIF.RIFAWARE.EXTI2\ Feature\ RTC\ global\ secure\ Wakeup\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ SPI8\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ SPI8\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU1\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU3\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ non\ secure\ tamper\ CPU3\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU1\ Secure=true
RIF.RIFAWARE.EXTI2\ Feature\ TAMP\ secure\ tamper\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ VDDCORE_VD\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ VDDCORE_VD\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ VDDCPU_VD\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ VDDCPU_VD\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ WWDG2\ reset\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ WWDG2\ reset\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU1_irq\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU2_irq\ Secure=false
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU3_irq\ Cid=-
RIF.RIFAWARE.EXTI2\ Feature\ lpdma1_ch0123_CPU3_irq\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_CFGR\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_CFGR\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NAND\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NAND\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM1\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM1\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM2\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM2\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM3\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM3\ Secure=false
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM4\ Cid=-
RIF.RIFAWARE.FMC\ Feature\ FMC_NOR/PSRAM4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PA1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PA1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PA1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA15\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PA15\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PA15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA3\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PA3\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PA3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA4\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PA4\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PA4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PA8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PA9\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PA9\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PA9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB1\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB1\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PB15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PB15\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PB15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB4\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB4\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB5\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB5\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PB6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB7\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB7\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB8\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB8\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PB9\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PB9\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PB9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC1\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PC1\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PC1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC11\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC2\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PC2\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PC2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PC6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PC6\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PC6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PC8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PC9\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PC9\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PC9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD0\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD0\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PD10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PD10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PD11\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PD11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PD14\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PD14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PD15\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PD15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD3\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD3\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD4\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD5\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD6\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ BootROMA35=true
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PD7\ Secure=true
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PD9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE0\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE1\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE11\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE12\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE13\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE14\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE15\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE2\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE3\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE3\ Secure=false
