jncronin/gk/gk-pcbv4/cubemx/cubemx.ioc
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE4\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE5\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE6\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE7\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PE8\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PE8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PE9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF12\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF13\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF14\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF15\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF5\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PF7\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PF7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PF9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PG0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG10\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG11\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG12\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG13\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG14\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG15\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG2\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PG2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG4\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PG4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PG5\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PG5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG6\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG6\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG7\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG8\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG8\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PG9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PG9\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PG9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PH10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PH10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PH11\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PH11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PH9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI0\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI0\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI1\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI1\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI12\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI12\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI12\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI13\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI13\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI13\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI14\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI15\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI2\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI2\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI3\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI3\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI4\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI4\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI5\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI5\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI7\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PI8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PI9\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PI9\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PI9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ10\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ11\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ12\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ13\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PJ14\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ Cid=1
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ CortexA35NSOS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ CortexA35NSSSBL=true
RIF.RIFAWARE.GPIO\ Feature\ PJ15\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PJ6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PJ9\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK3\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PK3\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PK3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK6\ Cid=2
RIF.RIFAWARE.GPIO\ Feature\ PK6\ CortexM33NS=true
RIF.RIFAWARE.GPIO\ Feature\ PK6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PK7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PK7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ0\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ1\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ2\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ3\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ4\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ5\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ6\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ7\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ8\ Secure=false
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Cid=-
RIF.RIFAWARE.GPIO\ Feature\ PZ9\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Cid=-
RIF.RIFAWARE.HPDMA1\ Feature\ HPDMA1\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Cid=-
RIF.RIFAWARE.HPDMA2\ Feature\ HPDMA2\ channel\ 9\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 0\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 1\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 10\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 11\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 12\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 13\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 14\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 15\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 2\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 3\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 4\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 5\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 6\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 7\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Cid=-
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 8\ Secure=false
RIF.RIFAWARE.HPDMA3\ Feature\ HPDMA3\ channel\ 9\ Cid=-
