jncronin/gk/gk-pcbv4/cubemx/cubemx.ioc
RIF.RIFAWARE.RCC\ Feature\ FMC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOA_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOB_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOC_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOD_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOE_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOF_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOG_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOH_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOI_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Cid=1&2
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexA35NSOS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexA35NSSSBL=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOJ_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Cid=2
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ CortexM33NS=true
RIF.RIFAWARE.RCC\ Feature\ GPIOK_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ GPIOZ_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HPDMA3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HSEM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ HSI_MON\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ IPCC2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPDMA_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ LPSRAM3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ MCO1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ MCO2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ OSPI1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ OSPI2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ PLL3_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Cid=2
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ CortexM33NS=true
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Secure=false
RIF.RIFAWARE.TAMP\ End\ Address=1174471424
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Secure=false
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ BootROMA35=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Cid=1
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SFSBLA=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Secure=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Secure=false
RIF.RIFAWARE.TAMP\ Size=512
RIF.RIFAWARE.TAMP\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF1\ Size=512
RIF.RIFAWARE.Zone1-RIF1\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF2\ Size=0
RIF.RIFAWARE.Zone1-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ Size=0
RIF.RIFAWARE.Zone2-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ Size=0
RIF.RIFAWARE.Zone2-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ Size=0
RIF.RIFAWARE.Zone3-RIF0\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ Size=0
RIF.RIFAWARE.Zone3-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ Size=0
RIF.RIFAWARE.Zone3-RIF2\ Start\ Address=1174471424
RIF.RISUP.CRYP1.Lock=true
RIF.RISUP.CRYP2.Lock=true
RIF.RISUP.ETHSW_ACM_CFG.Lock=true
RIF.RISUP.ETHSW_ACM_MSGBUF.Lock=true
RIF.RISUP.ETHSW_DEIP.Lock=true
RIF.RISUP.IWDG5.Lock=true
RIF.RISUP.OTFDEC1.Lock=true
RIF.RISUP.OTFDEC2.Lock=true
RIF.RISUP.PKA.Lock=true
RIF.RISUP.RAMCFG.Privilege=true
RIF.RISUP.SAES.Lock=true
RIF.SDMMC1_CID_RIMU=2
RIF.SDMMC2_CID_RIMU=2
RIF.USB3DR_CID_RIMU=1
RIF.USBH_CID_RIMU=1
RIF.default_config=true
SAI2.ErrorAudioFreq-SAI_A_MasterWithClock=-50.0 %
SAI2.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MckOutput-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock
SAI2.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
SAI2.MckOutput-SAI_A_MasterWithClock=SAI_MCK_OUTPUT_ENABLE
SAI2.RealAudioFreq-SAI_A_MasterWithClock=96.0 KHz
SAI2.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
SAI3.ErrorAudioFreq-SAI_A_MasterWithClock=-2.34 %
SAI3.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MckOutput-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock
SAI3.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
SAI3.MckOutput-SAI_A_MasterWithClock=SAI_MCK_OUTPUT_ENABLE
SAI3.RealAudioFreq-SAI_A_MasterWithClock=187.5 KHz
SAI3.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
SH.S_TIM1_CH1.0=TIM1_CH1,Output Compare1 CH1
SH.S_TIM1_CH1.ConfNb=1
SH.S_TIM1_CH2.0=TIM1_CH2,Output Compare2 CH2
SH.S_TIM1_CH2.ConfNb=1
SH.S_TIM1_CH3.0=TIM1_CH3,Output Compare3 CH3
SH.S_TIM1_CH3.ConfNb=1
SH.S_TIM2_CH1.0=TIM2_CH1,Output Compare1 CH1
SH.S_TIM2_CH1.ConfNb=1
SPI3.CalculateBaudRate=32.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualNSS=VM_NSSHARD
SPI3.VirtualType=VM_MASTER
TIM1.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
TIM1.Channel-Output\ Compare2\ CH2=TIM_CHANNEL_2
TIM1.Channel-Output\ Compare3\ CH3=TIM_CHANNEL_3
TIM1.IPParameters=Channel-Output Compare1 CH1,Channel-Output Compare2 CH2,Channel-Output Compare3 CH3
TIM2.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
TIM2.IPParameters=Channel-Output Compare1 CH1
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USART2.IPParameters=VirtualMode-Asynchronous
USART2.VirtualMode-Asynchronous=VM_ASYNC
USB3DR_DM.GPIOParameters=PinAttribute
USB3DR_DM.Mode=Device_mode_USB2
USB3DR_DM.PinAttribute=CortexA35NSOS
USB3DR_DM.Signal=USB3DR_DM
USB3DR_DP.GPIOParameters=PinAttribute
USB3DR_DP.Mode=Device_mode_USB2
USB3DR_DP.PinAttribute=CortexA35NSOS
USB3DR_DP.Signal=USB3DR_DP
USB3DR_TXRTUNE.GPIOParameters=PinAttribute
USB3DR_TXRTUNE.Mode=Device_mode_USB2
USB3DR_TXRTUNE.PinAttribute=CortexA35NSOS
USB3DR_TXRTUNE.Signal=USB3DR_TXRTUNE
USBH_HS_DM.GPIOParameters=PinAttribute
USBH_HS_DM.Mode=Enable
USBH_HS_DM.PinAttribute=CortexA35NSOS
USBH_HS_DM.Signal=USBH_HS_DM
USBH_HS_DP.GPIOParameters=PinAttribute
USBH_HS_DP.Mode=Enable
USBH_HS_DP.PinAttribute=CortexA35NSOS
USBH_HS_DP.Signal=USBH_HS_DP
USBH_HS_TXRTUNE.GPIOParameters=PinAttribute
USBH_HS_TXRTUNE.Mode=Enable
USBH_HS_TXRTUNE.PinAttribute=CortexA35NSOS
USBH_HS_TXRTUNE.Signal=USBH_HS_TXRTUNE
VP_ADC3_Vbat_Input.Mode=IN-Vbat
VP_ADC3_Vbat_Input.Signal=ADC3_Vbat_Input
VP_ADC3_VddCore_Input.Mode=IN-VddCore
VP_ADC3_VddCore_Input.Signal=ADC3_VddCore_Input
VP_ADC3_VddCpu_Input.Mode=IN-VddCpu
VP_ADC3_VddCpu_Input.Signal=ADC3_VddCpu_Input
VP_ADC3_VddGpu_Input.Mode=IN-VddGpu
VP_ADC3_VddGpu_Input.Signal=ADC3_VddGpu_Input
VP_ADC3_Vref_Input.Mode=IN-Vrefint
VP_ADC3_Vref_Input.Signal=ADC3_Vref_Input
VP_BSEC_VS_BSEC.Mode=BSEC_Activate
VP_BSEC_VS_BSEC.Signal=BSEC_VS_BSEC
VP_CORTEX_M33_VS_CORTEX_M33.Mode=CORTEX_M33_Activate
VP_CORTEX_M33_VS_CORTEX_M33.Signal=CORTEX_M33_VS_CORTEX_M33
VP_DDR_CTRL_PHY_LPDDR4.Mode=LPDDR4
VP_DDR_CTRL_PHY_LPDDR4.Signal=DDR_CTRL_PHY_LPDDR4
VP_DDR_CTRL_PHY_VS_16BITS.Mode=16bits
VP_DDR_CTRL_PHY_VS_16BITS.Signal=DDR_CTRL_PHY_VS_16BITS
VP_DDR_CTRL_PHY_VS_16Gb.Mode=16Gb
VP_DDR_CTRL_PHY_VS_16Gb.Signal=DDR_CTRL_PHY_VS_16Gb
VP_OCTOSPI1_VS_quad.Mode=quad_mode
VP_OCTOSPI1_VS_quad.Signal=OCTOSPI1_VS_quad
VP_OCTOSPIM_VS_IO.Mode=Direct
VP_OCTOSPIM_VS_IO.Signal=OCTOSPIM_VS_IO
VP_RIF_VS_RIF1.Mode=RISUP
VP_RIF_VS_RIF1.Signal=RIF_VS_RIF1
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_STGEN_VS_STGEN.Mode=STGEN_Activate
VP_STGEN_VS_STGEN.Signal=STGEN_VS_STGEN
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
